# Brewfile for `brew bundle`. Homebrew does not support version-pinned
# installation from a Brewfile — see Brewfile.versions for a record of
# known-working versions and setup.sh for drift detection.

# Core
brew "zsh"
brew "tmux"
brew "jq"

# CLI tools
brew "fd"
brew "ripgrep"
brew "git-delta"
brew "eza"
brew "bat"
brew "yq"
brew "httpie"
brew "tlrc"
brew "semgrep"
brew "duckdb"

# Fuzzy finder
brew "fzf"

# Directory jumping
brew "zoxide"

# Shell history
brew "atuin"

# Git status numbering
brew "scmpuff"
